/*
Navicat MySQL Data Transfer

Source Server         : CL
Source Server Version : 50621
Source Host           : localhost:3306
Source Database       : rent

Target Server Type    : MYSQL
Target Server Version : 50621
File Encoding         : 65001

Date: 2015-11-15 02:09:09
*/

SET FOREIGN_KEY_CHECKS=0;
-- ----------------------------
-- Table structure for `t_goods`
-- ----------------------------
DROP TABLE IF EXISTS `t_goods`;
CREATE TABLE `t_goods` (
  `uid` int(11) NOT NULL AUTO_INCREMENT,
  `typeid` int(11) DEFAULT NULL,
  `imagea` varchar(100) DEFAULT NULL,
  `title` varchar(50) DEFAULT NULL,
  `content` varchar(500) DEFAULT NULL,
  `linkman` varchar(20) DEFAULT NULL,
  `phone` varchar(20) DEFAULT NULL,
  `qq` varchar(20) DEFAULT NULL,
  `infoDate` datetime DEFAULT NULL,
  `state` int(11) DEFAULT NULL,
  `payfor` int(11) DEFAULT NULL,
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=52 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of t_goods
-- ----------------------------
INSERT INTO `t_goods` VALUES ('25', '1', '11.jpg', '『9成新』换闲置电饭煲一台，可租赁，可售卖', '  \r\n\r\n    电饭煲是刚进大学时候买的,容量为1L,一直没机会用,电饭煲是全新的,没有怎么使用过的。闲置在寝室。所以就想跟其他同学换些我能用到的物品。当然也可以租用给同学，也可以售卖给同学，有意向的同学可以跟我联系。\r\n\r\n联系我时，请说是在校园换宝网上看到的，谢谢！', '陈生', '15114523698', '125634811', '2015-10-07 00:00:54', '1', '1');
INSERT INTO `t_goods` VALUES ('26', '1', '12.jpg', '『9成新』换闲置烧水器一台，可租赁，可售卖', '\r\n\r\n烧水器是刚进大学时候买的,容量为1L,一直没机会用,烧水器是全新的,没有怎么使用过的。闲置在寝室。所以就想跟其他同学换些我能用到的物品。当然也可以租用给同学，也可以售卖给同学，有意向的同学可以跟我联系。\r\n\r\n联系我时，请说是在校园换宝网上看到的，谢谢！', '陈生', '15114523698', '125634811', '2015-10-08 00:00:00', '1', '1');
INSERT INTO `t_goods` VALUES ('27', '1', '13.jpg', '『9成新』换闲置台灯一台，可售卖', '\r\n\r\n       防近视台 大学毕业了 用不上了但是东西还是很好的 向让它帮助有需要的人。所以就想跟其他同学换些我能用到的物品。也可以售卖给同学，有意向的同学可以跟我联系。详情面谈。\r\n\r\n联系我时，请说是在校园换宝网上看到的，谢谢！', '徐生', '15114875961', '102145652', '2015-10-09 00:00:00', '1', '0');
INSERT INTO `t_goods` VALUES ('28', '1', '14.jpg', '『9成新』换闲置电风扇一台，可租赁，可售卖', '\r\n大学毕业了，空出来一个电风扇。还很新带不走，想跟其他同学换些我能用到的物品。当然也可以租用给同学，也可以售卖给同学，有意向的同学可以跟我联系。详情面谈。\r\n\r\n联系我时，请说是在校园换宝网上看到的，谢谢！', '徐生', '15114875961', '125634811', '2015-11-04 00:00:00', '1', '0');
INSERT INTO `t_goods` VALUES ('29', '3', '31.jpg', '『9成新』换数码相机玩玩', '      \r\n\r\n\r\n      该数码相机为本人财产，只提供换其他数码相机服务，因本人想体验下不同数码相机的操作和性能。有意向的同学可以跟我联系。详情面谈。\r\n\r\n联系我时，请说是在校园换宝网上看到的，谢谢！\r\n', '陈生', '15114875961', '125634811', '2015-10-01 00:00:00', '1', '1');
INSERT INTO `t_goods` VALUES ('30', '3', '34.jpg', '『9成新』换iphone手机互玩', '\r\n\r\n          手机本人已经买了1年，用久了，想换换口味，互换手机玩玩\r\n有意向的同学可以跟我联系。详情面谈。\r\n\r\n联系我时，请说是在校园换宝网上看到的，谢谢！', '陈生', '15114523698', '125634811', '2015-10-21 00:00:00', '1', '1');
INSERT INTO `t_goods` VALUES ('31', '4', '42.jpg', '『9成新』换闲置画板，可租赁，可售卖', '\r\n\r\n     之前有兴趣学了画画，现在没时间去学了，闲置画板一块就想跟其他同学换些我能用到的物品。当然也可以租用给同学，也可以售卖给同学，有意向的同学可以跟我联系。详情面谈。\r\n\r\n\r\n联系我时，请说是在校园换宝网上看到的，谢谢！', '徐生', '15114523698', '125634811', '2015-10-14 00:00:00', '1', '1');
INSERT INTO `t_goods` VALUES ('32', '4', '43.jpg', '『9成新』换闲置四级词典一本台，可租赁，可售卖', '\r\n\r\n     四级词典一本，本人过了四六级，闲置出四级词典就想跟其他同学换些我能用到的物品。当然也可以租用给同学，也可以售卖给同学，有意向的同学可以跟我联系。详情面谈。\r\n\r\n联系我时，请说是在校园换宝网上看到的，谢谢！', '陈生', '15114875961', '125634811', '2015-10-13 00:00:00', '1', '1');
INSERT INTO `t_goods` VALUES ('33', '5', '51.jpg', '『9成新』换闲置吉他一台，可租赁，可售卖', '\r\n\r\n  本人前年购买吉他一把，现在学业比较重，闲置出吉他一把想跟其他同学换些我能用到的物品。当然也可以租用给同学，也可以售卖给同学，有意向的同学可以跟我联系。详情面谈。\r\n\r\n联系我时，请说是在校园换宝网上看到的，谢谢！', '陈生', '15114523698', '102145652', '2015-10-24 00:00:00', '1', '1');
INSERT INTO `t_goods` VALUES ('34', '5', '52.jpg', '『9成新』换闲置架子鼓一台，可租赁，可售卖', '\r\n\r\n    刚开学买的架子鼓，最近没兴趣学了。闲置出来了，想跟其他同学换些我能用到的物品。当然也可以租用给同学，也可以售卖给同学，有意向的同学可以跟我联系。详情面谈。\r\n\r\n联系我时，请说是在校园换宝网上看到的，谢谢！', '李生', '15114523698', '125634811', '2015-10-27 00:00:00', '1', '0');
INSERT INTO `t_goods` VALUES ('35', '7', '63.jpg', '『9成新』换闲置网球拍', '\r\n\r\n         体育选修课买的，现在体育课过了，没时间去玩了，闲置出来了。想跟其他同学换些我能用到的物品。有意向的同学可以跟我联系。详情面谈。\r\n\r\n联系我时，请说是在校园换宝网上看到的，谢谢！', '王生', '18712652154', '12547812', '2015-10-19 00:00:00', '1', '1');
INSERT INTO `t_goods` VALUES ('36', '7', '64.jpg', '『9成新』换闲置轮滑鞋，可售卖', '   \r\n\r\n    \r\n       大一有兴趣玩轮滑买的，现在闲置出来了。想跟其他同学换些我能用到的物品。也可以售卖给同学，有意向的同学可以跟我联系。详情面谈。\r\n\r\n联系我时，请说是在校园换宝网上看到的，谢谢！', '陈生', '15114523698', '102145652', '2015-10-25 00:00:00', '1', '1');
INSERT INTO `t_goods` VALUES ('37', '8', '71.jpg', '『9成新』换旅游背包用用', '\r\n\r\n    大一买的背包，一直背着去旅游，想换下风格。有意向的同学可以跟我联系。详情面谈。\r\n\r\n联系我时，请说是在校园换宝网上看到的，谢谢！', '徐生', '15114523698', '102145652', '2015-09-09 00:00:00', '1', '1');
INSERT INTO `t_goods` VALUES ('38', '8', '74.jpg', '『9成新』西服闲置可换，可售卖', ' \r\n\r\n   毕业工作买的西服，还没来得穿，就工作了。想跟其他同学换些我能用到的物品。当然也可以租用给同学，也可以售卖给同学，有意向的同学可以跟我联系。详情面谈。\r\n\r\n联系我时，请说是在校园换宝网上看到的，谢谢！', '李生', '15114523698', '102145652', '2015-11-04 00:00:00', '1', '1');
INSERT INTO `t_goods` VALUES ('39', '9', '83.jpg', '『9成新』闲置自行车一辆，可租赁，可售卖', '\r\n\r\n    买的自行车没时间去骑，想跟其他同学换些我能用到的物品。当然也可以租用给同学，也可以售卖给同学，有意向的同学可以跟我联系。详情面谈。\r\n\r\n联系我时，请说是在校园换宝网上看到的，谢谢！', '王生', '15114875961', '123222', '2015-11-03 00:00:00', '1', '1');
INSERT INTO `t_goods` VALUES ('40', '9', '82.jpg', '『9成新』闲置山地车一辆，可租赁，可售卖', '\r\n\r\n\r\n       买的山地车，一直没机会去骑行，闲置出山地车，想跟其他同学换些我能用到的物品。当然也可以租用给同学，也可以售卖给同学，有意向的同学可以跟我联系。详情面谈。\r\n\r\n联系我时，请说是在校园换宝网上看到的，谢谢！', '李生', '15114875961', '102145652', '2015-11-20 00:00:00', '1', '1');
INSERT INTO `t_goods` VALUES ('41', '2', '21.jpg', 'java爱好者相互交流', '\r\n\r\n java书本一本，本人爱好java语言。希望能接触更多的专业书籍。\r\n有意向的同学可以跟我联系。详情面谈。\r\n\r\n联系我时，请说是在校园换宝网上看到的，谢谢！', '陈生', '15114523698', '125634811', '2015-11-28 00:00:00', '1', '1');
INSERT INTO `t_goods` VALUES ('42', '2', '23.jpg', 'java爱好者相互交流', '\r\n\r\n java书本一本，本人爱好java语言。希望能接触更多的专业书籍。\r\n有意向的同学可以跟我联系。详情面谈。\r\n\r\n联系我时，请说是在校园换宝网上看到的，谢谢！', '徐生', '15114875961', '102145652', '2015-10-20 00:00:00', '1', '1');
INSERT INTO `t_goods` VALUES ('43', '2', '22.jpg', 'java爱好者相互交流', '\r\n\r\n java书本一本，本人爱好java语言。希望能接触更多的专业书籍。\r\n有意向的同学可以跟我联系。详情面谈。\r\n\r\n联系我时，请说是在校园换宝网上看到的，谢谢！', '李生', '15114875961', '102145652', '2015-11-26 00:00:00', '1', '1');
INSERT INTO `t_goods` VALUES ('44', '2', '24.jpg', 'java爱好者相互交流', '\r\n\r\n java书本一本，本人爱好java语言。希望能接触更多的专业书籍。\r\n有意向的同学可以跟我联系。详情面谈。\r\n\r\n联系我时，请说是在校园换宝网上看到的，谢谢！', '王生', '18712652154', '102145652', '2015-10-12 00:00:00', '1', '1');
INSERT INTO `t_goods` VALUES ('45', '2', '25.jpg', 'javascript爱好者相互交流', '\r\n\r\n javascript书本一本，本人爱好javascript。希望能接触更多的专业书籍。有意向的同学可以跟我联系。详情面谈。\r\n\r\n联系我时，请说是在校园换宝网上看到的，谢谢！', '李生', '15114523698', '102145652', '2015-10-11 00:00:00', '1', '0');
INSERT INTO `t_goods` VALUES ('46', '2', '27.jpg', 'javaweb爱好者相互交流', '\r\n\r\n javaweb书本一本，本人爱好javaweb。希望能接触更多的专业书籍。有意向的同学可以跟我联系。详情面谈。\r\n\r\n联系我时，请说是在校园换宝网上看到的，谢谢！', '王生', '15114523698', '102145652', '2015-11-19 00:00:00', '1', '0');
INSERT INTO `t_goods` VALUES ('47', '2', '28.jpg', 'javaweb爱好者相互交流', '\r\n\r\n\r\njavaweb书本一本，本人爱好javaweb。希望能接触更多的专业书籍。有意向的同学可以跟我联系。详情面谈。\r\n\r\n联系我时，请说是在校园换宝网上看到的，谢谢！', '陈生', '18712652154', '125634811', '2015-10-20 00:00:00', '1', '0');
INSERT INTO `t_goods` VALUES ('48', '2', '26.jpg', '数据结构爱好者相互交流', '\r\n\r\n\r\n        数据结构书本一本，本人爱好数据结构。希望能接触更多的专业书籍。有意向的同学可以跟我联系。详情面谈。\r\n\r\n联系我时，请说是在校园换宝网上看到的，谢谢！', '陈生', '15114875961', '125634811', '2015-11-10 00:00:00', '1', '1');
INSERT INTO `t_goods` VALUES ('49', '9', '84.jpg', '『5成新』闲置小电动车一台', '   \r\n\r\n   \r\n     电动车用了一段时间，但是还是有五成新有意向的同学可以跟我联系。详情面谈。\r\n\r\n  联系我时，请说是在校园换宝网上看到的，谢谢！', '王生', '15114523698', '12547812', '2015-11-11 00:00:00', '1', '1');
INSERT INTO `t_goods` VALUES ('50', '9', '81.jpg', '『9成新』闲置自行车，可租赁，可售卖', '\r\n\r\n\r\n      闲置自行车一台，想跟其他同学换些我能用到的物品。当然也可以租用给同学，也可以售卖给同学，有意向的同学可以跟我联系。详情面谈。\r\n\r\n联系我时，请说是在校园换宝网上看到的，谢谢！', '李生', '18712652154', '102145652', '2015-12-04 00:00:00', '1', '1');
INSERT INTO `t_goods` VALUES ('51', '4', '11.jpg', 'javaweb爱好者相互交流', 'TFGGGGGGGG', '陈生', '15114875961', '125634811', '2015-11-08 20:48:31', '0', '1');

-- ----------------------------
-- Table structure for `t_topnews`
-- ----------------------------
DROP TABLE IF EXISTS `t_topnews`;
CREATE TABLE `t_topnews` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `typeSign` int(11) DEFAULT NULL,
  `typeName` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of t_topnews
-- ----------------------------
INSERT INTO `t_topnews` VALUES ('1', '1', '电器产品');
INSERT INTO `t_topnews` VALUES ('2', '2', '专业书籍');
INSERT INTO `t_topnews` VALUES ('3', '3', '数码产品');
INSERT INTO `t_topnews` VALUES ('4', '4', '学习用品');
INSERT INTO `t_topnews` VALUES ('5', '5', '乐器产品');
INSERT INTO `t_topnews` VALUES ('6', '6', '旅行物品');
INSERT INTO `t_topnews` VALUES ('7', '7', '文体产品');
INSERT INTO `t_topnews` VALUES ('8', '8', '服饰箱包');
INSERT INTO `t_topnews` VALUES ('9', '9', '代步产品');

-- ----------------------------
-- Table structure for `t_user`
-- ----------------------------
DROP TABLE IF EXISTS `t_user`;
CREATE TABLE `t_user` (
  `uid` int(11) NOT NULL AUTO_INCREMENT,
  `loginname` varchar(50) DEFAULT NULL,
  `loginpass` varchar(50) DEFAULT NULL,
  `qq` varchar(50) DEFAULT NULL,
  `states` tinyint(1) DEFAULT NULL,
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of t_user
-- ----------------------------
INSERT INTO `t_user` VALUES ('1', '陈林', '123', '123456', '1');
